<template>
  <div class="qr rounded bg-white w-full pt-3 pb-16 px-2">
    <div
      @click="$router.go(-1)"
      class="my-2 mx-6"
      style="cursor: pointer; display: flex; align-items: center"
    >
      <svg
        class="h-5 w-5 text-blue-500"
        width="24"
        height="24"
        viewBox="0 0 24 24"
        stroke-width="2"
        stroke="currentColor"
        fill="none"
        stroke-linecap="round"
        stroke-linejoin="round"
      >
        <path stroke="none" d="M0 0h24v24H0z" />
        <polyline points="15 6 9 12 15 18" />
      </svg>
      <p class="text-blue-500">{{$t('back')}} </p>
    </div>

    <div v-if="contract.debitor" class="mt-4">

      <div class="container">
        <div class="header flex">
          <div class="logo">
          <svg width="180" height="120" viewBox="0 0 89 65" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M21.8103 62.4585V64.1934H6.2511V62.8109L18.8286 46.9536H6.44085V45.2187H21.485V46.6012L8.93466 62.4585H21.8103ZM37.389 57.6607H25.4621C25.5705 59.1425 26.1397 60.3442 27.1698 61.2658C28.1998 62.1694 29.5009 62.6212 31.0731 62.6212C31.9586 62.6212 32.7718 62.4676 33.5127 62.1604C34.2536 61.8351 34.8952 61.3652 35.4373 60.7508L36.5216 61.9977C35.8891 62.7567 35.0939 63.335 34.1362 63.7325C33.1965 64.1301 32.1574 64.3289 31.0189 64.3289C29.5552 64.3289 28.254 64.0217 27.1156 63.4073C25.9952 62.7748 25.1187 61.9074 24.4862 60.805C23.8537 59.7027 23.5375 58.4558 23.5375 57.0643C23.5375 55.6729 23.8357 54.4259 24.432 53.3236C25.0464 52.2213 25.8777 51.3629 26.9258 50.7485C27.992 50.1341 29.1847 49.8269 30.5039 49.8269C31.8231 49.8269 33.0067 50.1341 34.0549 50.7485C35.103 51.3629 35.9252 52.2213 36.5216 53.3236C37.1179 54.4079 37.4161 55.6548 37.4161 57.0643L37.389 57.6607ZM30.5039 51.4804C29.1305 51.4804 27.9739 51.9231 27.0342 52.8086C26.1126 53.676 25.5886 54.8145 25.4621 56.224H35.5728C35.4463 54.8145 34.9132 53.676 33.9735 52.8086C33.0519 51.9231 31.8954 51.4804 30.5039 51.4804ZM43.1766 52.7273C43.6284 51.7695 44.2971 51.0467 45.1825 50.5587C46.0861 50.0708 47.1975 49.8269 48.5166 49.8269V51.6972L48.0558 51.6701C46.5559 51.6701 45.3813 52.1309 44.532 53.0525C43.6826 53.9742 43.258 55.2663 43.258 56.9288V64.1934H41.3334V49.9353H43.1766V52.7273ZM57.6969 64.3289C56.3235 64.3289 55.0856 64.0217 53.9833 63.4073C52.881 62.7748 52.0135 61.9074 51.3811 60.805C50.7486 59.7027 50.4323 58.4558 50.4323 57.0643C50.4323 55.6729 50.7486 54.4259 51.3811 53.3236C52.0135 52.2213 52.881 51.3629 53.9833 50.7485C55.0856 50.1341 56.3235 49.8269 57.6969 49.8269C59.0703 49.8269 60.3082 50.1341 61.4105 50.7485C62.5128 51.3629 63.3712 52.2213 63.9856 53.3236C64.6181 54.4259 64.9344 55.6729 64.9344 57.0643C64.9344 58.4558 64.6181 59.7027 63.9856 60.805C63.3712 61.9074 62.5128 62.7748 61.4105 63.4073C60.3082 64.0217 59.0703 64.3289 57.6969 64.3289ZM57.6969 62.6212C58.7089 62.6212 59.6124 62.3953 60.4076 61.9435C61.2208 61.4737 61.8532 60.8141 62.305 59.9647C62.7568 59.1154 62.9827 58.1486 62.9827 57.0643C62.9827 55.9801 62.7568 55.0133 62.305 54.1639C61.8532 53.3146 61.2208 52.664 60.4076 52.2122C59.6124 51.7424 58.7089 51.5075 57.6969 51.5075C56.6849 51.5075 55.7723 51.7424 54.9591 52.2122C54.164 52.664 53.5315 53.3146 53.0617 54.1639C52.6099 55.0133 52.384 55.9801 52.384 57.0643C52.384 58.1486 52.6099 59.1154 53.0617 59.9647C53.5315 60.8141 54.164 61.4737 54.9591 61.9435C55.7723 62.3953 56.6849 62.6212 57.6969 62.6212Z" fill="#2D62B6"/>
<path d="M81.1699 64.1934L75.0439 55.8445L68.9449 64.1934H66.6408L73.8512 54.435L67.1016 45.2187H69.4057L75.1252 52.9712L80.8176 45.2187H82.9861L76.2636 54.3808L83.5011 64.1934H81.1699Z" fill="#FE5E58"/>
<path d="M46.6407 4.53305L52.4639 4.53305L29.7612 31.6396L24.0011 31.6396L46.6407 4.53305Z" fill="#2D62B6"/>
<path d="M58.7261 11.1073L64.5493 11.1073L41.8466 38.2139L36.0865 38.2139L58.7261 11.1073Z" fill="#2D62B6"/>
<path d="M47.4317 14.4953L52.3506 14.4953L41.3945 27.7993L36.1988 27.7993L47.4317 14.4953Z" fill="#FE5E58"/>
</svg>

          </div>
          <div class="date">
                 <div>
        
          </div>
          </div>
        </div>
        <div
          class="mt-8"
          style="
            display: flex;
            justify-content: flex-end;
            align-items: center;
            margin-bottom: 3rem;
          "
        >
          
       
        </div>

        <div class="box qarz">
          <div class="content-title">
            <h2 ><span class="ml-2 font-extrabold" style="font-weight:800">Қ А Р З</span><span class="ml-2 font-extrabold" style="font-weight:800">  Ш А Р Т Н О М А С И   </span>         <span class="ml-2 font-extrabold">№ {{ contract && contract.number }}</span></h2>
          </div>
          <div class="content-body">
            <p>
              <span>
                {{ contract.debitor.last_name }}
                {{ contract.debitor.first_name }}                
                {{ contract.debitor.middle_name }}
              </span>
              (паспорт:
              <span
                >{{ contract.debitor.passport }}.
                {{ contract.debitor.issued_date }}</span
              >
              йилда <span>{{contract.debitor.issued_by}}</span> томонидан берилган) (кейинги
              ўринларда “Қарз берувчи”) биринчи томондан,
              <span
                >
                 {{ contract.creditor.last_name }}
                {{ contract.creditor.first_name }}               
                {{ contract.creditor.middle_name }}</span
              >
              (паспорт:
              <span
                >{{ contract.creditor.passport }}.
                {{ contract.creditor.issued_date }}</span
              >
              йилда
              <span>{{contract.debitor.issued_by}}</span>
              томонидан берилган) (кейинги ўринларда “Қарз олувчи”) иккинчи
              томондан ҳамда “Infinity payment system” МЧЖ (СТИР: 309053853)
              (кейинги ўринларда “Жамият”) учинчи томондан ушбу шартномани
              қуйидагилар ҳақида туздилар
            </p>
          </div>
        </div>
        <div class="box qarz">
          <div class="content-title">
            <h2>1. Шартнома предмети</h2>
          </div>
          <div class="content-body">
            <ul>
              <li>
                <p>
                  1.1.Қарз берувчи мазкур шартноманинг шартларига мувофиқ Қарз
                  олувчига
                  <span
                    >{{
                    contract.amount &&   contract.amount
                        .toString()
                        .replace(/\B(?=(\d{3})+(?!\d))/g, " ")
                    }}  
                  </span>
                  <span class="font-bold"> {{ $route.query.currency }} </span>миқдорида пул маблағини фоизсиз қарзга
                  беради, Қарз олувчи эса ўз зиммасига мазкур маблағни қайтариш
                  мажбуриятини олади;
                </p>
              </li>
              <li>
                <p>
                  1.2.Мазкур шартноманинг 1.1-бандида қайд этилган миқдордаги
                  қарз суммаси Қарз олувчи томонидан Қарз берувчига қисмларга
                  бўлиб қайтарилиши мумкин;
                </p>
              </li>
              <li>
                <p>
                  1.3.Қарзнинг тўлиқ миқдори <span style="font-weight:800">{{ contract.end_date &&  dateFormat(contract.end_date)}}</span> йилга қадар қайтарилиши
                  шарт.
                </p>
              </li>
            </ul>
          </div>
        </div>
        <div class="box qarz">
          <div class="content-title">
            <h2>2.Томонларнинг ҳуқуқ ва мажбуриятлари</h2>
          </div>
          <div class="content-body">
            <ul>
              <li>
                <p>
                  2.1.Қарз берувчи мазкур шартнома имзоланган кундан бошлаб 1
                  кун муддат ичида шартноманинг 1.1-бандида кўрсатилган
                  миқдордаги пул маблағини нақд ёки нақдсиз шаклда Қарз олувчига
                  далолатнома асосида тақдим этади; Далолатномада у тузилган
                  сана, тарафларнинг реквизитлари, Қарз олувчига пул маблағи
                  тақдим этилган сана ва бошқа маълумотлар кўрсатилади. Ушбу
                  далолатнома Томонлар томонидан махсус электрон имзо (кейинги
                  ўринларда “Имзо”) билан имзолангандан сўнг мазкур қарз
                  шартномасининг ажралмас қисми ҳисобланади.
                </p>
              </li>
              <li>
                <p>
                  2.2.Қарз олувчи олинган қарз суммасини мазкур шартноманинг
                  1.3-бандида назарда тутилган муддатга қадар Қарз берувчига
                  қайтаради;
                </p>
              </li>
              <li>
                <p>
                  2.3.Қарз берувчи Қарз олувчидан шартнома бўйича берилган қарз
                  суммасини шартномада келишилган муддатдан аввал талаб қилишга,
                  қарз шартномаси муддатини узайтиришга ва қарздан воз кечишга
                  ҳақли.
                </p>
              </li>
              <li class="pagebreak">
                <p>
                  2.4.Қарз олувчи Қарз берувчи қарзни қайтариш ҳақида талаб
                  қўйган кундан бошлаб 1 ой (ўттиз кун) мобайнида қарзни
                  қайтариши лозим. Агар Қарз олувчи ўттиз кунлик муддатда Қарз
                  берувчига қарзни қайтармаса, қарз муддати бузилган ҳисобланади
                  ва ҳар бир кечиктирилган кун учун 3.1-бандида белгиланган
                  тартибда пеня тўлайди.
                </p>
              </li>
              <li>
                <p>
                  2.5.Қарз олувчи қарз суммасини муддатидан аввал Қарз берувчига
                  қайтаришга ва қарз шартномаси муддатини узайтириш учун
                  сўровнома юборишга ҳақли.
                </p>
              </li>
              <li>
                <p>
                  2.6.Томонлар мазкур шартномани электрон шаклда
                  тасдиқлашганликлари билан улар қарз шартномасидаги маълумотлар
                  (фойдаланувчининг статуси, дебитор ва кредитор
                  қарздорликларининг жами суммаси ҳамда муддати ўтган
                  қарздорликларининг суммаси) нинг учинчи шахсларга берилишига
                  розилик билдиришганлигини англатади. Бунда Жамият томонидан
                  томонларнинг шахсига оид маълумотлар учинчи шахсларга тақдим
                  қилинмайди.
                </p>
              </li>
            </ul>
          </div>
        </div>
        <div class="box qarz">
          <div class="content-title">
            <h2>3.Томонларнинг жавобгарлиги</h2>
          </div>
          <div class="content-body">
            <ul>
              <li>
                <p>
                  3.1.Қарз олувчи ушбу шартноманинг 1.3-бандида назарда тутилган
                  муддатга қадар Қарз берувчига қарзни қайтармаса, ҳар бир
                  кечиктирилган кун учун 0,5 (ярим) фоиз, лекин қарз суммасининг
                  50 (эллик) фоизидан ортиқ бўлмаган миқдорда пеня тўлайди.
                </p>
              </li>
            </ul>
          </div>
        </div>
        <div class="box qarz">
          <div class="content-title">
            <h2>4.Шартноманинг бошқа шартлари</h2>
          </div>
          <div class="content-body">
            <ul>
              <li>
                <p>
                  4.1.Мазкур шартнома Қарз берувчи ва Қарз олувчи томонидан
                  “ZeroX” дастури орқали электрон тарзда тузилади ва Имзо билан
                  тасдиқланади.
                </p>
              </li>
              <li>
                <p>
                  4.2.“ZeroX” дастуридан фойдаланиш бўйича тузилган “Универсал
                  шартнома”нинг 11-бандига асосан биринчи ва иккинчи томонлар
                  шартномани ўзларига индивидуал тарзда берилган махсус электрон
                  имзо билан имзоланишига розилигини билдиради ҳамда махсус
                  электрон имзо қўлда қўйилган имзо билан бир ҳил аҳамиятга эга
                  эканлигини зиммасига олади.
                </p>
              </li>
              <li>
                <p>
                  4.3.Шартнома томонлар имзоланган вақтдан бошлаб кучга киради
                  ва <span style="font-weight:800">{{ contract.end_date &&  dateFormat(contract.end_date)}}</span> йилга қадар амал қилади.
                </p>
              </li>
              <li>
                <p>
                  4.4.Қарз олувчи қарз суммасини муддатидан аввал Қарз берувчига
                  қайтарган тақдирда қарз суммаси қарз берувчи томонидан қабул
                  қилиб олинганлиги ҳақида далолатнома Имзо билан имзоланган
                  кундан шартнома бекор бўлиши мумкин.
                </p>
              </li>
              <li>
                <p>
                  4.5.Мазкур шартнома ва унинг ажралмас қисми ҳисобланган
                  далолатномалар электрон тарзда тузилади ҳамда икки томоннинг
                  “ZeroX” дастуридаги шахсий кабинетида сақланади.
                </p>
              </li>
              <li>
                <p>
                  4.6.Қарз олувчи ва Қарз берувчи томонидан Имзо билан
                  тасдиқланган мазкур шартномани ва унинг ажралмас қисми
                  ҳисобланган далолатномаларни “ZeroX” дастуридаги шахсий
                  кабинетидан исталган вақтда кўчириб олиши ҳамда чоп этиши
                  мумкин.
                </p>
              </li>
              <li>
                <p>
                  4.7.Имзо билан тасдиқланган мазкур шартнома ва унинг ажралмас
                  қисми ҳисобланган далолатномаларнинг сақланишини Жамият ўз
                  зиммасига олади.
                </p>
              </li>
              <li>
                <p>
                  4.8.Мазкур шартномага киритиладиган ҳар қандай ўзгартиришлар
                  томонларнинг розилиги асосида қўшимча шартнома тузиш йўли
                  билан амалга оширилади.
                </p>
              </li>
              <li>
                <p>
                  4.9.Шартнома юзасидан келиб чиқадиган низолар томонларнинг
                  ўзаро келишуви билан ҳал этилади. Жамият шартнома шартлари
                  бажарилишини ўз зиммасига олмайди. Томонлар ўзаро келишувга
                  эришмаган тақдирда низо тегишли тартибда суд орқали ҳал
                  этилади.
                </p>
              </li>
            </ul>
          </div>
        </div>
     
      </div>
    </div>


  </div>
</template>

<script>

import dateformat from "dateformat";
export default {
  middleware:'auth',
  data: () => ({
    contract: {

    },
  }),
  async created() {

    if(!this.$route.query.debitor) {
        return this.$router.go(-1)
    }
    console.log(this.$route.query)
    this.contract['debitor'] = this.$route.query.debitor
    this.contract['creditor'] = this.$route.query.creditor
    this.contract['amount'] = this.$route.query.amount
    this.contract['end_date'] = this.$route.query.end_date
    // this.contract['currency'] = this.$route.query.currency
  },
 
  methods: {
    dateFormat(date) {
      let date1 = dateformat(date, "isoDate");
      date1 = date1.split("-").reverse();
      date1 = date1.join(".");
      return date1;
    },  
  },
};
</script>

<style lang="css" scoped>
.qr-code {
  width: 150px;
  position: relative;
}

.qr-code-image {
  position: absolute;
  background-color: rgb(252, 249, 249);
  border-radius: 0.25rem;
  z-index: 50000;
  box-shadow: 0 0.125rem 0.25rem rgba(0, 0, 0, 0.25);
  left: 50%;
  overflow: hidden;
  position: absolute;
  top: 50%;
  transform: translate(-50%, -50%);
}
.pdf {
  width: 250px;
  height: 250px;
  box-shadow: 0px 4px 10px 3px rgba(0, 0, 0, 0.11);
  border-radius: 67px;
  background: #ffffff;
}

.container {
  width: 8.5in;
  min-height: 11in;
  padding: 2rem 3rem;
  margin: 0 auto;
  margin-top: 2rem;
  box-shadow: 0 0 5px 0 rgba(0, 0, 0, 0.5);
}

.flex {
  display: flex;
  justify-content: space-between;
  align-items: center;
}
.content-title {
  text-align: center;
}
.qarz {
  margin: 20px 0;
}
.qarz .content-title {
  margin-bottom: 20px;
}
.qarz span {
  color: black;
  font-weight: 600;
}
.content-body p {
  font-size: 14px;
  text-align: justify;
  word-break: break-word;
  text-indent: 50px;
}
.qarz ul li p {
  font-size: 14px;
}
.rekvizit {
  display: flex;
  flex-direction: column;
  align-items: center;
}
.rek-title {
  margin-bottom: 10px;
  text-align: center;
}
.rek-body {
  margin-bottom: 10px;
}
.rek-title h2:last-child {
  color: black;
  font-weight: 600;
}
</style>